alplabai/gd32-bridge-firmware/hal/gd32/init.c
/* The wrapper's PUBLIC include directories expose the GigaDevice device
 * header.  It supplies the CMSIS/core definitions and pulls this project's
 * hal/gd32g5x3_libopt.h selector, which exposes the peripheral declarations
 * used by the real backend.  The vendor wrapper compiles its driver archive
 * independently; libopt controls declarations, not which driver units link. */
#include "gd32g5x3.h"
#include "gd32_common.h"

/* ----------------------------------------------------------------- */
/* Boot hooks (overrides of the weak defaults in src/main.c)         */
/* ----------------------------------------------------------------- */

/* Called once on entry to main() before the transport ISRs come online.
 * This brings up the backend's boot-global clocks, pads and peripheral
 * state; request-time operations live in the per-peripheral TUs.  There is
 * no SysTick handler -- base-level housekeeping runs after each main-loop
 * wake.  No DA9292 wiring exists on this SoM rev; see
 * bridge_hw_da9292_status_cached(). */
/* Sampled at the head of bridge_hw_init (#127); see gd32_common.h for
 * what reads them and why nothing acts on a mismatch yet.  Initialised to
 * the value the constants ASSUME so a debugger attaching before
 * bridge_hw_init has run does not read a spurious 0 and conclude the
 * clock tree is broken. */
uint32_t bridge_core_clock_hz      = PWM_TIMER_CLK_HZ;
bool     bridge_core_clock_matches = true;

/* I/O compensation cell verdict (gh#66): true after bridge_hw_init()
 * iff SYSCFG_CPSCTL.CPS_RDY confirmed the cell ready within its
 * bounded spin.  Volatile so a bench probe can read it after boot;
 * no functional consumer today -- the cell is enable-and-forget. */
volatile bool gpio_compensation_ready;

void bridge_hw_init(void)
{
#if defined(BRIDGE_OTA_PARTITIONED) && defined(BRIDGE_APP_SLOT_BASE)
	/* OTA Path-A: the app runs from a flash slot, not 0x08000000, so move
     * the vector table off the vendor SystemInit default before any NVIC
     * use.  Runs first (main calls bridge_hw_init before the transports
     * enable interrupts). */
	SCB->VTOR = (uint32_t)(BRIDGE_APP_SLOT_BASE);
	__DSB();
	__ISB();
	/* The Path-A bootloader hands off with PRIMASK SET (it runs
     * __disable_irq() before swapping MSP/VTOR for the jump) -- without
     * clearing it here no interrupt ever fires in the slot app and the
     * transports go silent (silicon-caught 2026-06-04: CM33 retried init
     * 1600+ times against a slot app whose CS-EXTI could never run).
     * Re-enable now that OUR vector table is live; on a plain power-on
     * boot PRIMASK is already clear and this is a no-op. */
	__enable_irq();
#endif

	/* ORDERING (merge of #61's se_reset_init and #127's clock sample):
     * se_reset_init() goes FIRST and that is load-bearing -- see its
     * comment below on PC13 floating in ANALOG mode from reset.  The
     * clock sample that follows is a pure register read with no side
     * effects and derives nothing se_reset_init() needs (the SE reset is
     * a GPIO push-pull level, with no clock-derived timing anywhere in
     * hal/gd32/se_reset.c), so putting it second costs the #127 check
     * nothing: nothing between these two statements consumes
     * SystemCoreClock either. */
	/* Secure-element reset (SE_RST = PC13): promote it to a released-
     * level push-pull output FIRST, ahead of every other peripheral
     * bring-up below.  PC13 has no entry in `gpio_pad_map` (see
     * hal/gd32/gpio.c), so from reset until whichever statement first
     * touches it, it sits at its GPIO POR default -- ANALOG mode,
     * with the input buffer and both pull resistors disabled (UM
     * Rev1.2 p.270 §7.3.7): genuinely floating, not merely un-pulled.
     * The TRNG bring-up a few statements below this used to run first
     * and can alone spend up to ~1 ms in that state (hal/gd32/trng.c)
     * -- but that is NOT the dominant exposure: the pre-main() SramInit
     * loop floats PC13 for ~20-25 ms before bridge_hw_init() is ever
     * called (see the header comment in hal/gd32/se_reset.c for the
     * derivation).  That window is not fixable by moving this call any
     * earlier -- there is nowhere earlier in this backend to move it
     * to -- so gh#61 stays open after this reorder; this promotion
     * only bounds boot from main() onward and closes the separate
     * sub-microsecond OCTL-preload-vs-mode-promote gap inside
     * se_reset_configure() itself.  Needs only its own GPIOC clock;
     * the bulk AHB2 enable just below
     * re-enables it harmlessly for the rest of port C's pads. */
	rcu_periph_clock_enable(RCU_GPIOC);
	se_reset_init();

	/* #127: sample the clock the vendor's SystemInit() ACTUALLY left
     * running, before anything derived from it is programmed.  Until this
     * call the repo never referenced SystemCoreClock at all: every timing
     * constant in gd32_common.h -- PWM_TIMER_CLK_HZ, PWM_TIMER_PRESCALER,
     * BRIDGE_ADC_PACE_CLK_HZ, and the DWT "~4.63 ns LSB" claim in
     * counter.c -- was asserted against a number no code checked, set by a
     * SystemInit() that lives in another repository and whose variant is
     * chosen by a wrapper this repo does not own.
     *
     * SystemCoreClockUpdate() re-derives the value from the live RCU
     * registers rather than trusting the compile-time initialiser, so this
     * is the one place the firmware can find out it is running on the
     * wrong clock tree.  It is a pure register read plus arithmetic: no
     * side effects, safe this early.
     *
     * The result is recorded, not acted on.  See the declarations in
     * gd32_common.h for why refusing supervised outputs on a mismatch is
     * a follow-up rather than part of this change. */
	SystemCoreClockUpdate();
	bridge_core_clock_hz      = SystemCoreClock;
	bridge_core_clock_matches = (SystemCoreClock == PWM_TIMER_CLK_HZ);

	/* I/O compensation cell (gh#66): set SYSCFG_CPSCTL.CPS_EN (bit 0,
	 * UM Rev1.2 p.68-69 §1.7.15, offset 0x3C) and wait for CPS_RDY
	 * (bit 8, read-only) with a BOUNDED spin in the same shape as the
	 * VREFRDY wait below -- recording the verdict, never hanging.
	 * The cell controls output commutation slew (tfall/trise) across
	 * the whole I/O ring: the SPI pads' speed-10 class spans tR/tF
	 * 4.0-6.6 ns across supply alone (Datasheet Rev2.0 p.130 Table
	 * 4-30) -- 65% spread before process and temperature -- and a
	 * marginal unit at a corner has less edge margin against the
	 * master's CS-to-first-SCK window than a bench unit shows.
	 * RCU_SYSCFG is NOT re-enabled here; transport_hw_gd32.c already
	 * enabled it.  The compensation-code programming path UM p.271
	 * describes is deliberately not attempted: Rev1.2 defines no
	 * register for it and CPSCTL has no code field -- only the
	 * enable-and-let-hardware-compensate mode is reachable.
	 * Sequencing per gh#66: this is a PVT-robustness measure on
	 * links that already work, so it lands in the same change as the
	 * I2C drive-class drop, and BOTH need the bench re-validation
	 * the issue names (SPI setup window, PWM edges, I2C falls)
	 * before the verdict counts as settled. */
	{
		bool     comp_ready = false;
		uint32_t spins      = 0u;
		SYSCFG_CPSCTL |= SYSCFG_CPSCTL_CPS_EN;
		while (spins++ < 200000u) {
			if (0u != (SYSCFG_CPSCTL & SYSCFG_CPSCTL_CPS_RDY)) {
				comp_ready = true;
				break;
			}
		}
		/* Verdict recorded for a bench read (volatile: no other
		 * reader today; a never-ready cell must not hang boot). */
		gpio_compensation_ready = comp_ready;
	}

	/* Enable AHB2 clocks for every GPIO port the pad map references.
     * The chip's RCU keeps unused GPIO ports clock-gated to save
     * power; we enable A..F unconditionally because the E1M IO map
     * spans those ports.  Port G isn't referenced by any pad. */
	rcu_periph_clock_enable(RCU_GPIOA);
	rcu_periph_clock_enable(RCU_GPIOB);
	rcu_periph_clock_enable(RCU_GPIOC);
	rcu_periph_clock_enable(RCU_GPIOD);
	rcu_periph_clock_enable(RCU_GPIOE);
	rcu_periph_clock_enable(RCU_GPIOF);

	/* Pad map parking (gh#66): leave every entry in `gpio_pad_map`
	 * at its CTLy = 0b11 ANALOG reset state -- input buffer and both
	 * pull resistors disabled (UM Rev1.2 p.270 §7.3.7), which is what
	 * all eighteen pads already reset to (p.275).  The old INPUT +
	 * PULL_UP park sank 1.8 V / 40 kΩ = 45 µA per pad continuously
	 * from boot into every pad a carrier holds LOW (Datasheet
	 * Rev2.0 p.128 Table 4-28: RPU = 40 kΩ, "value guaranteed by
	 * design") -- on a part whose whole point in modes 2/3 is low
	 * standing current.  bridge_hw_gpio_read() now promotes a pad to
	 * INPUT + PULLUP lazily on the first CMD_GPIO_READ that names
	 * it (with a settling allowance for the pull-up charging the pad
	 * capacitance), mirroring the existing lazy OUTPUT promotion in
	 * bridge_hw_gpio_write(); gpio_is_output[] stays the write-side
	 * truth.  Tradeoff made deliberately per gh#66: an unconnected
	 * E1M IO reads 0 only while its pad is parked analog (ISTAT
	 * reads 0 in analog mode, UM p.270) -- the first READ names it,
	 * promotes it, and every later read is the pulled-up level. */
	for (size_t i = 0; i < GPIO_PAD_MAP_COUNT; ++i) {
		gpio_is_output[i] = false;
	}

	/* TRNG bring-up: configure + enable only.  The NIST pipeline's
     * first conditioned word can lag past any boot-time wait we are
     * willing to spin; readiness is promoted lazily by the first
     * TRNG_READ's short DRDY poll (by which point the host's boot
     * settle has given the analog source seconds, not milliseconds). */
	trng_started = trng_start();
	if (trng_started) {
		/* Boot-time readiness grace: the transports aren't up yet, so
         * spending a few milliseconds here is free and spares the
         * FIRST host TRNG_READ the one-time conditioning latency
         * (observed on the functional tier: the inaugural read paid
         * the promotion and answered STATUS_IO once).  Bounded; the
         * lazy per-read path remains the safety net. */
		for (unsigned round = 0u; round < 8u && trng_started && !trng_ready; ++round) {
			(void)trng_poll_ready();
		}
	}

	/* TMU clock enable.  Per-op configuration happens in
     * bridge_hw_tmu_compute because the mode + I/O width vary per
     * call. */
	rcu_periph_clock_enable(RCU_TMU);

